//amaze ui
//表单验证扩展正则

(function($) {
  	if ($.AMUI && $.AMUI.validator) {
    // 增加多个正则
    $.AMUI.validator.patterns = $.extend($.AMUI.validator.patterns, {
      zhongwen: /^[\u4e00-\u9fa5]*$/,//中文字符
      idcard: /^(\d{15}$|^\d{18}$|^\d{17}(\d|X|x))$/,//身份证号
      lv: /^\d+.?\d*$|([0-9.]+)[ ]*%/,//匹配利率
      date: /^[0-9]{4}-(((0[13578]|(10|12))-(0[1-9]|[1-2][0-9]|3[0-1]))|(02-(0[1-9]|[1-2][0-9]))|((0[469]|11)-(0[1-9]|[1-2][0-9]|30)))$/, //匹配日期
      shouji: /^1((3|5|8){1}\d{1}|70)\d{8}$/,//国内手机号码（匹配 13x/15x/18x/170 号段)
      yzbm: /^\d{6}$/,//国内邮政编码
      dksq_qx: /^([1-9]|[12][0-9]|30)(个月|天)/,//贷款申请期限1-30个月（天）
    });
    
  }
})(window.jQuery);